#+TITLE: Computer Science Notes
*** Greater Common Divisor
#+begin_src cpp
#include <iostream>
#include <algorithm>
using namespace std;

int main()
{
	cout << __gcd(6, 20) << endl;
}

#+end_src

#+RESULTS:
: 2

*** Get Intersections
#+begin_src cpp
#include <iostream>     // std::cout
#include <algorithm>    // std::set_intersection, std::sort
#include <vector>       // std::vector

int main () {
  int first[] = {5,10,15,20,25};
  int second[] = {50,40,30,20,10};
  std::vector<int> v(10);                      // 0  0  0  0  0  0  0  0  0  0
  std::vector<int>::iterator it;

  std::sort (first,first+5);     //  5 10 15 20 25
  std::sort (second,second+5);   // 10 20 30 40 50

  it=std::set_intersection (first, first+5, second, second+5, v.begin());
                                               // 10 20 0  0  0  0  0  0  0  0
  v.resize(it-v.begin());                      // 10 20

  std::cout << "The intersection has " << (v.size()) << " elements:\n";
  for (it=v.begin(); it!=v.end(); ++it)
    std::cout << ' ' << *it;
  std::cout << '\n';

  return 0;
}
#+end_src

#+RESULTS:
| The | intersection | has | 2 | elements: |
|  10 |           20 |     |   |           |

** String/Char to int in C(++)
#+begin_src cpp
#include <sstream>
#include <iostream>
using namespace std;

int main() {
    string s = "12345";
    stringstream geek(s);
    int x = 0;
    geek >> x;
    cout << "Value of x : " << x;
}
#+end_src
#+RESULTS:
: Value of x : 12345
** Get All Possible Sub-strings
#+begin_src cpp
// C++ implementation of the approach #include <bits/stdc++.h> using namespace std;

// Function to return the number of // ways of partitioning int ways(string s, int n) {

	int dp[n][n];

	// Initialize DP table for (int i = 0; i < n; i++) for (int j = 0; j < n; j++) {
	dp[i][j] = 0; }

	// Base Case for (int i = 0; i < n; i++) dp[0][i] = 1;

	for (int i = 1; i < n; i++) {

		// To store sub-string S[i][j] string temp; for (int j = i; j < n; j++) { temp +=
		s[j];

			// To store sub-string S[k][i-1] string test; for (int k = i - 1; k >= 0; k--) {
			test += s[k]; if (test < temp) { dp[i][j] += dp[k][i - 1]; } } } }

	int ans = 0; for (int i = 0; i < n; i++) { // Add all the ways where S[i][n-1] // will
	be the last partition ans += dp[i][n - 1]; }

	return ans; }

// Driver code int main() { string s = "aabc"; int n = s.length();

	cout << ways(s, n);

	return 0; }

#+end_src

#+RESULTS:
: 6
